Repository: CuongScript/PestLens_MobileApp
Catalog: pest_lens_app/lib/l10n/app_*.arb
Languages: vi

# logInPass
source: Password
vi: Mật khẩu

# logInForgotPass
source: Forgot Password?
vi: Quên mật khẩu?

source: Sign In
vi: Đăng nhập

source: Sign Up
vi: Đăng ký

source: Username
vi: Tên đăng nhập

# reEnterPass
source: Re-enter password
vi: Nhập lại mật khẩu

source: Create Account
vi: Tạo tài khoản mới

# termAndPolicy
source: I accept the terms and privacy policy
vi: Tôi đồng ý với các điều khoản và chính sách bảo mật

# alreadyAccount
source: Already have an account? Log in
vi: Đã có tài khoản? Đăng nhập ngay

# textForgotPass
source: Please enter the email associated with your account.
vi: Vui lòng nhập email đã liên kết với tài khoản của bạn.

source: Send Code
vi: Gửi mã

# checkEmail
source: Please check your email
vi: Hãy kiểm tra email của bạn

# textVerifyEmail
source: We've sent a code to your email
vi: Chúng tôi đã gửi một mã xác nhận đến email của bạn

source: Verify
vi: Xác nhận

# resetPass
source: Reset Password
vi: Đặt lại mật khẩu

# textResetPass
source: Set a new password for your account.
vi: Hãy thiết lập một mật khẩu mới cho tài khoản của bạn.

# noIntConnect
source: An internet connection is required for checking the insects!
vi: Cần kết nối internet để kiểm tra thông tin!

# noIntConnect1
source: Please reconnect to your network
vi: Vui lòng kết nối mạng và thử lại

# noServerConnect
source: Server error!
vi: Lỗi kết nối máy chủ!

# noServerConnect1
source: Server is currently down.
vi: Máy chủ đang gặp sự cố.

# noServerConnect2
source: Please come back later!
vi: Vui lòng thử lại sau!

# usernameRequired
source: Username is required.
vi: Bạn cần nhập tên đăng nhập.

# emailRequired
source: Email is required.
vi: Bạn cần nhập email.

# invalidEmail
source: Invalid email address.
vi: Email không hợp lệ.

# passwordRequired
source: Password is required.
vi: Bạn cần nhập mật khẩu.

# passwordTooShort
source: Password must be at least 6 characters.
vi: Mật khẩu phải dài ít nhất 6 ký tự.

# passwordMismatch
source: Passwords do not match.
vi: Mật khẩu nhập lại không khớp.

source: Signup Failed
vi: Đăng ký không thành công

source: Signup Success
vi: Đăng ký thành công

# unknownError
source: An unknown error occurred.
vi: Có lỗi không xác định xảy ra.

# comeToLogin
source: Proceed to Login
vi: Chuyển đến đăng nhập

source: Sign Up Again
vi: Đăng ký lại

# invalidCredentials
source: Unable to login, please check you username and password.
vi: Thông tin đăng nhập không chính xác, vui lòng kiểm tra lại.

# errorForgotPassword
source: The inputed email is not registered. Please try again.
vi: Email này chưa được đăng ký. Vui lòng kiểm tra lại.

# invalidForgetPasswordVerificationCode
source: the code is invalided. Please try again.
vi: Mã xác nhận không đúng. Vui lòng thử lại.

source: OK
vi: Đồng ý

# noImg
source: No images available
vi: Không có hình ảnh

# arggeNumber
source: Aggregation Number of Insects
vi: Số lượng côn trùng được ghi nhận

# noData
source: No data available
vi: Không có dữ liệu

# selectRange
source: Please select a range of 30 days or less
vi: Vui lòng chọn khoảng thời gian không quá 30 ngày

source: Select Date Range
vi: Chọn khoảng ngày

source: Cancel
vi: Hủy bỏ

source: Confirm
vi: Xác nhận

# cameraNotAvail
source: Camera not Available
vi: Camera không khả dụng

source: Retry
vi: Thử lại

# histNumb
source: Historical Number of Insects
vi: Số lượng côn trùng theo lịch sử

# userAccDistri
source: Users Account Distribution
vi: Phân bổ tài khoản người dùng

source: Total
vi: Tổng cộng

source: Error
vi: Lỗi

# activeUser
source: Activate User
vi: Kích hoạt người dùng

# deactiveUser
source: Deactivate User
vi: Ngừng kích hoạt người dùng

# activateUser
source: Are you sure you want to activate this user?
vi: Bạn có chắc muốn kích hoạt người dùng này không?

# deactivateUser
source: Are you sure you want to deactivate this user?
vi: Bạn có chắc muốn ngừng kích hoạt người dùng này không?

# passResetSuccess
source: Password Reset Successfully
vi: Đặt lại mật khẩu thành công

# passResetFail
source: Password Reset Failed
vi: Đặt lại mật khẩu thất bại

source: Go to Login
vi: Đi đến trang đăng nhập

source: Try Again
vi: Thử lại

# accountCreatedSuccess
source: Your account has been created successfully.
vi: Tài khoản của bạn đã được tạo thành công.

# accountCreatedFailed
source: There was an error creating your account. Please try again.
vi: Không thể tạo tài khoản. Vui lòng thử lại.

source: Warning
vi: Cảnh báo

# profileImgFail
source: Profile image upload failed, but the signup process can continue. You can try uploading your profile image later.
vi: Không thể tải ảnh đại diện, bạn có thể tiếp tục đăng ký và thử tải ảnh sau.

source: Continue Signup
vi: Tiếp tục đăng ký

# failImgUpload
source: Failed to load image
vi: Tải ảnh lên thất bại

# noImgData
source: No image data
vi: Không có dữ liệu hình ảnh

source: Dashboard
vi: Bảng điều khiển

# userStatusUpdatedSuccess
source: User status updated successfully!
vi: Đã cập nhật trạng thái người dùng thành công!

# userStatusUpdatedFail
source: Failed to update user status
vi: Cập nhật trạng thái người dùng thất bại

# userAccount
source: User Accounts
vi: Tài khoản người dùng

# noUserFound
source: No users found
vi: Không tìm thấy người dùng

source: User Profile
vi: Hồ sơ người dùng

# enter4Digit
source: Please enter 4 digits (0-9)
vi: Vui lòng nhập 4 chữ số

# tokenExpire
source: Token expired or invalid.
vi: Mã đã hết hạn hoặc không hợp lệ.

# clickResendCode
source: Click here to resend code
vi: Nhấn vào đây để gửi lại mã

# sendCodeAgain
source: Send code again in
vi: Gửi mã lại trong

# notification
source: Notifications
vi: Thông báo

# noNotify
source: No notifications
vi: Không có thông báo

# caughtUpNotify
source: You are all caught up!
vi: Bạn đã cập nhật hết các thông báo!

source: Today
vi: Hôm nay

# last7Day
source: Last 7 Days
vi: 7 ngày qua

# setting
source: Settings
vi: Cài đặt

source: Logout
vi: Đăng xuất

# userProfileDetail
source: User Profile Details
vi: Chi tiết hồ sơ người dùng

# farmTitle
source: PH Farm
vi: Nông trại PH

source: Quantity
vi: Số lượng

# insectInfo
source: Insect Information
vi: Thông tin côn trùng

source: Insect data refreshed
vi: Dữ liệu côn trùng đã được làm mới

source: Set to Current Date
vi: Đặt thành ngày hiện tại

# loadTimeOut
source: Loading timed out after 5 seconds
vi: Quá trình tải đã quá thời gian 5 giây

source: Activate
vi: Kích hoạt

source: Deactivate
vi: Ngừng kích hoạt

# errorReadLocalFile
source: Error reading local file
vi: Lỗi khi đọc tệp tin địa phương

# errorFetchImgS3
source: Error fetching image from S3
vi: Lỗi khi tải hình ảnh từ S3

source: Admin Account
vi: Tài khoản quản trị

source: Farmer Account
vi: Tài khoản nông dân

# weatherDataErrorFetch
source: Error fetching weather data
vi: Lỗi khi tải dữ liệu thời tiết

# weatherInfoError
source: Weather information is not available
vi: Thông tin thời tiết không có sẵn

source: Back
vi: Quay lại

source: Next
vi: Tiếp theo

# successSignAndFailImgUpload
source: Signup successful, but profile image upload failed.
vi: Đăng ký thành công nhưng tải ảnh hồ sơ thất bại.

source: First Name
vi: Tên

source: Last Name
vi: Họ

# phoneNum
source: Phone Number
vi: Số điện thoại

source: Phone
vi: Điện thoại

source: Role
vi: Vai trò

source: Account Status
vi: Trạng thái tài khoản

source: Created At
vi: Ngày tạo

source: Last Login
vi: Lần đăng nhập cuối

# activateAt
source: Activated At
vi: Ngày kích hoạt

source: New User
vi: Người dùng mới

source: Yes
vi: Có

source: No
vi: Không

# errorFetchInsectData
source: Error fetching insect data
vi: Lỗi khi tải dữ liệu côn trùng

# camFeed1
source: Camera Feed 1
vi: Camera 1

# camFeed2
source: Camera Feed 2
vi: Camera 2

source: Support Status
vi: Trạng thái hỗ trợ

source: Currently Supported
vi: Đang được hỗ trợ

source: Future Supported
vi: Sẽ được hỗ trợ

# errorFetchImg
source: Error fetching image for
vi: Lỗi tải hình ảnh cho

# errorLoadImg
source: Failed to load image for
vi: Không thể tải hình ảnh cho

# searchInsect
source: Search insects
vi: Tìm kiếm côn trùng

# errorLoadInsectImg
source: Failed to load insects. Please try again later.
vi: Không tải được hình ảnh côn trùng. Vui lòng thử lại sau.

# errorLoadInsect
source: Error loading insects
vi: Lỗi tải côn trùng

# unexpectedError
source: An unexpected error occurred. Please try again.
vi: Đã xảy ra lỗi bất ngờ. Vui lòng thử lại.

source: Dismiss
vi: Bỏ qua

source: Insect Lookup
vi: Tra cứu côn trùng

# centerImg
source: Center the insect in the image. Ensure the insect is clearly focused.
vi: Đặt côn trùng vào giữa hình ảnh. Đảm bảo rằng côn trùng được lấy nét rõ ràng.

source: Photos
vi: Ảnh

source: Camera
vi: Máy ảnh

source: Identify Insect
vi: Xác định côn trùng

source: AI Count Result
vi: Kết quả đếm AI

# refreshInsectProfile
source: Refreshing insect profile...
vi: Làm mới hồ sơ côn trùng

source: Insect Profile
vi: Hồ sơ côn trùng

# scienceName
source: Scientific Name
vi: Tên khoa học

source: Size
vi: Kích thước

source: Habitat
vi: Môi trường sống

source: Impact
vi: Tác động

source: Behavior
vi: Hành vi

# errorOccurred
source: An error occurred!
vi: Đã xảy ra lỗi!

# googleSignIn
source: Sign in with Google
vi: Đăng nhập bằng Google
